app/views/users/show.html.erb

SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---
<span style="visibility: hidden">
<%= @rola= Role.find(@user.role_id)%> </span>