app/controllers/carts_controller.rb

  def show_all_cart
      @products = Product.all
      @carts = Cart.all
---
SELECT `products`.* FROM `products`
SELECT `carts`.* FROM `carts`

  def buy
    carts = Cart.all
    carts.each do |cart|
      if cart.user_id.equal?(current_user.id)
        Cart.destroy(cart.id)
        object = History.create(user_id:cart.user_id, product_id:cart.product_id, quantity:cart.quantity, date:cart.created_at)
---
SELECT `carts`.* FROM `carts`
DELETE FROM `carts` WHERE `carts`.`id` = 24
INSERT INTO `histories` (`user_id`, `product_id`, `quantity`, `date`, `created_at`, `updated_at`) VALUES (4, 3, 1, '2019-09-01', '2019-09-01 14:18:46', '2019-09-01 14:18:46')

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 24 LIMIT 1