app/controllers/histories_controller.rb

  def show_all_history
    @products = Product.all
    @histories = History.all
---
SELECT `products`.* FROM `products`
SELECT `histories`.* FROM `histories`