app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE (name = '%#{search}%')
---
  def show_all
      @products = Product.search(params[:search])

INSERT INTO `carts` (`user_id`, `product_id`, `quantity`, `created_at`, `updated_at`) VALUES (2, 1, 1, '2019-01-22 10:38:31', '2019-01-22 10:38:31')
---
  def add_to_cart
#imat cemo listu proizvoda kao globalnu varijablu i tu dodavat proizvode koje prosljedjujemo
#iz show i te proizvode cemo prikazivati u show_all
      #@cproduct = Product.find_by_id(params[:id])
      #$products_in_cart.push(@cproduct)
      @products = Product.all
      @cart = Cart.create(user_id: params[:user_id], product_id: params[:id], quantity: '1')

UPDATE `products` SET `name` = 'Subaru Foresterrr', `updated_at` = '2019-09-01 14:21:02' WHERE `products`.`id` = 3
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM `products` WHERE `products`.`id` = 2
---
  def destroy
    @product.destroy