app/controllers/services_controller.rb

SELECT `services`.* FROM `services`
---
  def index
    @services = Service.all

SELECT `services`.* FROM `services`
---
  def show_my_services
    @services = Service.all

INSERT INTO `services` (`car_name`, `bought_here`, `user_id`, `description`, `status`, `created_at`, `updated_at`) VALUES ('Golf 2', 1, 2, 'nestalo benzina', 'new', '2019-02-23 21:09:22', '2019-02-23 21:09:22')
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save

UPDATE `services` SET `description` = 'opis kvara', `updated_at` = '2019-02-01 01:26:16' WHERE `services`.`id` = 1
---
  def update
    respond_to do |format|
      if @service.update(service_params)

DELETE FROM `services` WHERE `services`.`id` = 7
---
  def destroy
    @service.destroy

SELECT  `services`.* FROM `services` WHERE `services`.`id` = 7 LIMIT 1
---
    def set_service
      @service = Service.find(params[:id])